ИТ_Фирма/src/Documents/НачислениеПремииПроцентом/НачислениеПремииПроцентом.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>НачислениеПремииПроцентом</name>
  <registerRecords>CalculationRegister.Зарплата</registerRecords>
  <attributes>
    <name>ПроцентПремии</name>
    <type>
      <types>DefinedType.Денежный</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Сотрудники</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ИТ_Фирма/src/CalculationRegisters/Зарплата/Зарплата.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:CalculationRegister>
  <name>Зарплата</name>
  <periodicity>Month</periodicity>
  <actionPeriod>true</actionPeriod>
  <basePeriod>true</basePeriod>
  <schedule>InformationRegister.Календарь</schedule>
  <scheduleValue>InformationRegister.Календарь.Resource.РабочихДней</scheduleValue>
  <scheduleDate>InformationRegister.Календарь.Dimension.Дата</scheduleDate>
  <chartOfCalculationTypes>ChartOfCalculationTypes.НачисленияУдержания</chartOfCalculationTypes>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <attributes>
    <name>Показатель</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
</mdclass:CalculationRegister>

ИТ_Фирма/src/Documents/НачислениеПремииПроцентом/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.Зарплата.Очистить();
	
	Для Каждого Строка Из Сотрудники Цикл
		
		ДвижениеЗарплата = Движения.Зарплата.Добавить();	
		ДвижениеЗарплата.ВидРасчета = ПланыВидовРасчета.НачисленияУдержания.Премия;
		ДвижениеЗарплата.Сотрудник = Строка.Сотрудник;
		ДвижениеЗарплата.ПериодДействияНачало = НачалоМесяца(Дата);
		ДвижениеЗарплата.ПериодДействияКонец = КонецМесяца(Дата);
		ДвижениеЗарплата.ПериодРегистрации = Дата;
		ДвижениеЗарплата.БазовыйПериодНачало = НачалоМесяца(Дата);
		ДвижениеЗарплата.БазовыйПериодКонец = КонецМесяца(Дата);
	    Движения.Зарплата.Записать();
	
	КонецЦикла;
	
	ПремияПроцентом();

КонецПроцедуры

Процедура ПремияПроцентом()

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗарплатаБазаЗарплата.СуммаБаза КАК СуммаБаза,
	               |	ЗарплатаБазаЗарплата.НомерСтроки КАК НомерСтроки,
	               |	ЗарплатаБазаЗарплата.Показатель КАК Показатель
	               |ИЗ
	               |	РегистрРасчета.Зарплата.БазаЗарплата(
	               |			&Измерения,
	               |			&Измерения,
	               |			,
	               |			Регистратор = &Регистратор
	               |				И ВидРасчета = &ВидРасчета) КАК ЗарплатаБазаЗарплата";
	
	Запрос.УстановитьПараметр("Регистратор", Ссылка);
	Запрос.УстановитьПараметр("ВидРасчета", ПланыВидовРасчета.НачисленияУдержания.Премия);
	Измерения = Новый Массив;
	Измерения.Добавить("Сотрудник");
	Запрос.УстановитьПараметр("Измерения", Измерения);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Движение = Движения.Зарплата[Выборка.НомерСтроки-1];
		
		Сумма = Выборка.СуммаБаза * ПроцентПремии / 100;
		
		Движение.Сумма = Сумма;
		
	КонецЦикла;
	
	Движения.Зарплата.Записать(, Истина);
	
КонецПроцедуры
